# InvalidRebarHostNonConcrete Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..InvalidRebarHostNonConcrete Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar can't be placed in a structural family unless its [Material Type] is [Concrete].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidRebarHostNonConcrete { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidRebarHostNonConcrete As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidRebarHostNonConcrete {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace